artillery/load-test.yml
config:
  payload:
    # path is relative to the location of the test script
    path: 'uuids.csv'
    delimiter: '€' # Just on fields with commas caracters in it.
    fields:
      - 'uuid'
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3001
  phases:
    - duration: '5m'
      name: "Cruise"
      arrivalRate: 20
scenarios:
  - flow:
    - get:
        url: '/mocks/mocks/items/{{ uuid }}?cc=public,max-age={{ $randomNumber(1,300) }}'
        capture:
          - header: 'last-modified'
            as: 'lastModified'
    - think: '{{ $randomNumber(1,300) }}s'
    - get:
        url: '/mocks/mocks/items/{{  uuid }}?cc=public,max-age={{ $randomNumber(1,300) }}'
        headers:
          'If-Modified-Since': '{{ lastModified }}'
        ifTrue: 'lastModified'